data = {"instances": [{"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "From: creps@lateran.ucs.indiana.edu (Stephen A. Creps)<br />Subject: Re: The doctrine of Original Sin<br />Organization: Indiana University<br />Lines: 31<br /><br />In article &lt;May.11.02.39.02.1993.28325@athos.rutgers.edu&gt; Eugene.Bigelow@ebay.sun.com writes:<br />&gt;&gt;This all obviously applies equally well to infants or adults, since<br />&gt;&gt;both have souls.  Infants must be baptized, therefore, or they cannot<br />&gt;&gt;enter into Heaven.  They too need this form of life in them, or they<br />&gt;&gt;cannot enter into Heaven.<br />&gt;<br />&gt;Are you saying that baptism has nothing to do with asking Jesus to come into<br />&gt;your heart and accepting him as your savior, but is just a ritual that we<br />&gt;must go through to enable us to enter Heaven?<br /><br />   I don't think Joe was saying any such thing.  However, your question<br />on \"asking Jesus to come into your heart\" seems to imply that infants<br />are not allowed to have Christ in theirs.  Why must Baptism always be<br />viewed by some people as a sort of \"prodigal son\" type of thing; i.e. a<br />sudden change of heart, going from not accepting Christ to suddenly<br />accepting Christ?  Why can't people start out with Christ from shortly<br />after birth, and build their relationship from there?  After all, does<br />a man suddenly meet a woman, and then marry her that same day?  From my<br />experiences, I've learned that all relationships must be built,<br />including one's relationship with God.<br /><br />   Also Joe is speaking from the standpoint that Baptism is not just a<br />ritual, but that through it God bestows sacramental grace upon the<br />recipient.  Certainly for those with the mental faculties to know Christ<br />it is necessary to believe in Him.  However, the Sacrament itself<br />bestows grace on the recipient, and makes a permanent mark of adoption<br />into God's family on the soul.<br /><br />-\t-\t-\t-\t-\t-\t-\t-\t-\t-<br />Steve Creps, Indiana University<br />creps@lateran.ucs.indiana.edu<br />", "exp": [["wrote", -0.069297946348712794], ["au", -0.062465891108053874], ["who", 0.040151264400799171], ["am", 0.038721210820057451]]}, "id": 10, "true_class": 1}, {"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "From: frank@D012S658.uucp (Frank O'Dwyer)<br />Subject: Re: Theism and Fanatism (was: Islamic Genocide)<br />Organization: Siemens-Nixdorf AG<br />Lines: 164<br />NNTP-Posting-Host: d012s658.ap.mchp.sni.de<br /><br />In article &lt;16BB7B863.I3150101@dbstu1.rz.tu-bs.de&gt; I3150101@dbstu1.rz.tu-bs.de (Benedikt Rosenau) writes:<br />#In article &lt;1r0sn0$3r@horus.ap.mchp.sni.de&gt;<br />#frank@D012S658.uucp (Frank O'Dwyer) writes:<br /># <br />#&gt;|&gt;#&gt;#Theism is strongly correlated with irrational belief in absolutes. Irrational<br />#&gt;|&gt;#&gt;#belief in absolutes is strongly correlated with fanatism.<br /># <br />#(deletion)<br /># <br />#&gt;|Theism is correlated with fanaticism. I have neither said that all fanatism<br />#&gt;|is caused by theism nor that all theism leads <span style=\"color: #4dac26; font-weight:bold;\">to</span> fanatism. The point is,<br />#&gt;|theism increases the chance of becoming a fanatic. One could of course<br />#&gt;|argue that would be fanatics tend towards theism (for example), but I just<br />#&gt;|have <span style=\"color: #4dac26; font-weight:bold;\">to</span> loook at the times in history when theism was the dominant ideology<br />#&gt;|<span style=\"color: #4dac26; font-weight:bold;\">to</span> invalidate that conclusion that that is the basic mechanism behind it.<br />#&gt;<br />#&gt;IMO, the influence of Stalin, or for that matter, Ayn Rand, invalidates your<br />#&gt;assumption that theism is the factor <span style=\"color: #4dac26; font-weight:bold;\">to</span> be considered.<br /># <br />#Bogus. I just said that theism is not the only factor for fanatism.<br />#The point is that theism is *a* factor.<br /><br />That's your claim; now back it up.  I consider your argument as useful<br />as the following:  Belief is strongly correlated with fanaticism.  Therefore<br />belief is *a* factor in fanaticism.  True, and utterly useless.  (Note, this<br />is *any* belief, not belief in Gods)<br /><br />#&gt;Gullibility,<br />#&gt;blind obedience <span style=\"color: #4dac26; font-weight:bold;\">to</span> authority, lack of scepticism, and so on, are all more<br />#&gt;reliable indicators.  And the really dangerous people - the sources of<br />#&gt;fanaticism - are often none of these things.  They are cynical manipulators<br />#&gt;of the gullible, who know precisely what they are doing.<br /># <br />#That's a claim you have <span style=\"color: #4dac26; font-weight:bold;\">to</span> support. Please note that especially in the<br />#field of theism, the leaders believe what they say.<br /><br />If you believe that, you're incredibly naive.<br /><br />#&gt;Now, *some*<br />#&gt;brands of theism, and more precisely *some* theists, do tend <span style=\"color: #4dac26; font-weight:bold;\">to</span> fanaticism,<br />#&gt;I grant you.  To tar all theists with this brush is bigotry, not a reasoned<br />#&gt;argument - and it reads <span style=\"color: #4dac26; font-weight:bold;\">to</span> me like a warm-up for censorship and restriction<br />#&gt;of religious freedom.  Ever read Animal Farm?<br />#&gt;<br />#That's a straw man. And as usually in discussions with you one has <span style=\"color: #4dac26; font-weight:bold;\">to</span><br />#repeat it: Read what I have written above: not every theism leads <span style=\"color: #4dac26; font-weight:bold;\">to</span><br />#fanatism, and not all fanatism is caused by theism. The point is,<br />#there is a correlation, and it comes from innate features of theism.<br /><br />No, some of it comes from features which *some* theism has in common<br />with *some* fanaticism.    Your last statement simply isn't implied by<br />what you say before, because you're trying <span style=\"color: #4dac26; font-weight:bold;\">to</span> sneak in \"innate features<br />of [all] theism\".  The word you're groping for is \"some\".<br /><br />#Gullibility, by the way, is one of them.<br /><br />No shit, Sherlock.  So why not talk about gullibility instead of theism,<br />since it seems a whole lot more relevant <span style=\"color: #4dac26; font-weight:bold;\">to</span> the case you have, as opposed<br /><span style=\"color: #4dac26; font-weight:bold;\">to</span> the case you are trying <span style=\"color: #4dac26; font-weight:bold;\">to</span> make?<br /><br />#And <span style=\"color: #4dac26; font-weight:bold;\">to</span> say that I am going <span style=\"color: #4dac26; font-weight:bold;\">to</span> forbid religion is another of your straw<br />#men. Interesting that you have nothing better <span style=\"color: #4dac26; font-weight:bold;\">to</span> offer.<br /><br />I said it reads like a warm up <span style=\"color: #4dac26; font-weight:bold;\">to</span> that.  That's because it's an irrational<br />and bogus tirade, and has no other use than creating a nice Them/Us <br />split in the minds of excitable people such as are <span style=\"color: #4dac26; font-weight:bold;\">to</span> be found on either<br />side of church walls.<br /><br />#&gt;|&gt;(2)  Define \"irrational belief\".  e.g., is it rational <span style=\"color: #4dac26; font-weight:bold;\">to</span> believe that<br />#&gt;|&gt;     reason is always useful?<br />#&gt;|&gt;<br />#&gt;|<br />#&gt;|Irrational belief is belief that is not based upon reason. The latter has<br />#&gt;|been discussed for a long time with Charley Wingate. One point is that<br />#&gt;|the beliefs violate reason often, and another that a process that does<br />#&gt;|not lend itself <span style=\"color: #4dac26; font-weight:bold;\">to</span> rational analysis does not contain reliable information.<br />#&gt;<br />#&gt;Well, there is a glaring paradox here:  an argument that reason is useful<br />#&gt;based on reason would be circular, and argument not based on reason would<br />#&gt;be irrational.  Which is it?<br />#&gt;<br />#That's bogus. Self reference is not circular. And since the evaluation of<br />#usefulness is possible within rational systems, it is allowed.<br /><br />O.K., it's oval.  It's still begging the question, however.  And though<br />that certainly is allowed, it's not rational.  And you claiming <span style=\"color: #4dac26; font-weight:bold;\">to</span> be<br />rational and all.<br /><br />At the risk of repeating myself, and hearing \"we had that before\" [we<br />didn't hear a _refutation_ before, so we're back.   Deal with it] :<br />you can't use reason <span style=\"color: #4dac26; font-weight:bold;\">to</span> demonstrate that reason is useful.  Someone<br />who thinks reason is crap won't buy it, you see.<br /><br />#Your argument is as silly as proving mathematical statements needs mathematics<br />#and mathematics are therfore circular.<br /><br />Anybody else think Godel was silly?<br /><br />#&gt;The first part of the second statement contains no information, because<br />#&gt;you don't say what \"the beliefs\" are.  If \"the beliefs\" are strong theism<br />#&gt;and/or strong atheism, then your statement is not in general true.  The<br />#&gt;second part of your sentence is patently false - counterexample: an<br />#&gt;axiomatic datum does not lend itself <span style=\"color: #4dac26; font-weight:bold;\">to</span> rational analysis, but is<br />#&gt;assumed <span style=\"color: #4dac26; font-weight:bold;\">to</span> contain reliable information regardless of what process is<br />#&gt;used <span style=\"color: #4dac26; font-weight:bold;\">to</span> obtain it.<br />#&gt;<br /># <br />#I've been speaking of religious systems with contradictory definitions<br />#of god here.<br /># <br />#An axiomatic datum lends itself <span style=\"color: #4dac26; font-weight:bold;\">to</span> rational analysis, what you say here<br />#is a an often refuted fallacy. Have a look at the discussion of the<br />#axiom of choice. And further, one can evaluate axioms in larger systems<br />#out of which they are usually derived. \"I exist\" is derived, if you want<br />#it that way.<br />#<br />#Further, one can test the consistency and so on of a set of axioms.<br /># <br />#what is it you are trying <span style=\"color: #4dac26; font-weight:bold;\">to</span> say?<br /><br />That at some point, people always wind up saying \"this datum is reliable\" <br />for no particular reason at all.  Example: \"I am not dreaming\".<br /><br />#&gt;|Compared the evidence theists have for their claims <span style=\"color: #4dac26; font-weight:bold;\">to</span> the strength of<br />#&gt;|their demands makes the whole thing not only irrational but antirational.<br />#&gt;<br />#&gt;I can't agree with this until you are specific - *which* theism?  To<br />#&gt;say that all theism is necessarily antirational requires a proof which<br />#&gt;I suspect you do not have.<br />#&gt;<br /># <br />#Using the traditonal definition of gods. Personal, supernatural entities<br />#with objective effects on this world. Usually connected <span style=\"color: #4dac26; font-weight:bold;\">to</span> morals and/or<br />#the way the world works.<br /><br />IMO, any belief about such gods is necessarily irrational.  That does<br />not mean that people who hold them are in principle opposed <span style=\"color: #4dac26; font-weight:bold;\">to</span> the exercise of<br />intelligence.  Some atheists are <span style=\"color: #4dac26; font-weight:bold;\">also</span> scientists, for example.<br /><br />#&gt;|The affinity <span style=\"color: #4dac26; font-weight:bold;\">to</span> fanatism is easily seen. It has <span style=\"color: #4dac26; font-weight:bold;\">to</span> be true because I believe<br />#&gt;|it is nothing more than a work hypothesis. However, the beliefs say they are<br />#&gt;|more than a work hypothesis.<br />#&gt;<br />#&gt;I don't understand this.  Can you formalise your argument?<br /># <br />#Person A believes system B becuase it sounds so nice. That does not make<br />#B true, it is at best a work hypothesis. However, the content of B is that<br />#it is true AND that it is more than a work hypothesis. Testing or evaluating<br />#evidence for or against it  therefore dismissed because B (already believed)<br />#says it is wronG/ a waste  of time/ not possible. Depending on the further<br />#contents of B Amalekites/Idolaters/Protestants are <span style=\"color: #4dac26; font-weight:bold;\">to</span> be killed, this can<br />#have interesting effects.<br /><br />Peculiar definition of interesting, but sure.  Now show that a belief<br />in gods entails the further contents of which you speak.   Why aren't my <br />catholic neighbours out killing the protestants, for example?   Maybe they <br />don't believe in it.  Maybe it's the conjunction of \"B asserts B\" and<br />\"jail/kill dissenters\" that is important, and the belief in gods is<br />entirely irrelevant.  It certainly seems so <span style=\"color: #4dac26; font-weight:bold;\">to</span> me, but then I have no<br />axe <span style=\"color: #4dac26; font-weight:bold;\">to</span> grind here. <br /><br />-- <br />Frank O'Dwyer                                  'I'm not hatching That'<br />odwyer@sse.ie                                  from \"Hens\",  by Evelyn Conlon<br />", "exp": [["alt", -0.034752033629233091], ["try", -0.026929927130057128], ["also", 0.023969585419456523], ["to", 0.023555976272313674]]}, "id": 394, "true_class": 0}, {"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "From: bobbe@vice (Robert Beauchaine;6086;59-323;LP=A;YAyG)<br />Subject: More Best of A.A<br />Lines: 164<br /><br /><br /><br />\t\t\tRAPTURE - OCTOBER 28, 1992<br /><br />\t\tWHAT TO DO IN CASE YOU MISS THE RAPTURE<br /><br />I. STAY CALM AND DO NOT PANIC<br /><br />\tYour natural reaction once you realize what has just occurred is to<br />panic.  But to do so is absolutely useless now.  If you had wanted to get right<br />with God before the rapture, you could have, but you chose to wait.  Now your <br />only chance is to stay on this earth and to endure to the end of the <br />Tribulation.  \"But he that shall endure unto the end, the same shall be <br />saved.\" - Matthew 24:13<br /><br />II. REALIZE YOU ARE NOW LIVING DURING THE GREAT TRIBULATION<br /><br />\tThe Great Tribulation is a seven year period starting from the time of<br />the rapture until Christ's second coming.  Also know as \"the time of Jacob's<br />(Israel's) trouble\" (Jere 30:7) and \"Daniel's Seventieth Week\" (Dan 9), this <br />period will be unparalleled in trouble and horror.<br /><br />III. GATHER AS MANY BIBLES AS YOU CAN AND HIDE THEM<br /><br />\tSoon after the Antichrist becomes the leader of the European Community <br />(the revived Roman Empire), Bibles will be confiscated and owning a Bible will<br />be tantamount to treason.  The Bible, however, will be your most valuable <br />possession during the Tribulation.<br /><br />IV. READ THE BIBLE LIKE YOU HAVE NEVER READ IT BEFORE IN YOUR LIFE<br /><br />\tSince all of your Bibles may be confiscated, even if you are careful, it<br />is imperative that you read the Word until you memorize whole passages and can<br />quote them.  It is especially important to read Daniel, Luke 21, Matthew 24, <br />Revelation, and Amos, for these books describe the events you can expect to<br />unfold before you.  <br /><br />V. PRAY LIKE YOU HAVE NEVER PRAYED BEFORE IN YOUR LIFE<br /><br />\tPray until the power of God comes strongly upon you - pray and pray <br />and pray.  Only by reading the Word and praying will you gain the spiritual <br />strength to be able to withstand the torture you may have to endure for the<br />sake of Christ.  <br /><br />VI. DO NOT TAKE THE MARK AT ANY COST - EVEN IN FIT MEANS YOU AND YOUR LOVED<br />ONES DIE AS MARTYRS<br /><br />\tAfter the Antichrist becomes the leader of the European Community, he<br />will institute a world economic system, designed so that you cannot buy, sell,<br />or eat unless you take his mark or the number of his name.  Money will be<br />useless.  \"And he causes all, both small and great, rich and poor, free and <br />slave, to receive a mark on their right hand or on their foreheads, and that<br />no one may buy or sell except one who has the mark or the name of the beast, <br />or the number of his name.  Here is wisdom.  Let him who has understanding<br />calculate the number of the beast, for it is the number of a man: His number<br />is 666\" - Revelation 13:16-18.  <br />\tThe Antichrist will implement the greatest slaughter in all of <br />humanity.  Think of the various ways people have been tortured and killed<br />in the past, such as the Holocaust.<br />[or maybe the crusades? -M]<br /><span style=\"color: #d01c8b; font-weight:bold;\">You</span> cannot even imagine the horror that will take place under the Antichrist's<br />rule; it will be much worse than anything in history (Matt 24:21) \"...I saw<br />under the altar the souls of those who had been slain for the word of God and<br />for the testimony which they held.  And a white robe was given to each of <br />them: and it was said to them that they should rest a little while longer, <br />until both the number of the fellow servants and their brethren, who would be<br />killed as they were, was completed.\" Revelation 6:9, 11.<br />\tHis targets will be Jews and Christians who do not worship his image<br />or take the mark on their forehead or right hadn/ \"...And I saw the souls of <br />those who had been beheaded for their witness to Jesus and for the word of <br />God, who had not worshiped the beast or his image, and had not received his mark<br />on their foreheads or on the hands.\" - Revelation 20:4.  He will use every<br />form of torture and humiliation in order to force you to renounce Christ.  Nor<br />will he hesitate to use your loved ones against you, even your children, <br />torturing and killing them in front of you so that you will be tempted to take<br />the mark.  <br />\tIf you take the mark or worship the Antichrist or his image, however,<br />you will be consigned to the second death, which is the Lake of Fire.<br />[Sung about so eloquently by Johnny Cash...-M]<br /><span style=\"color: #d01c8b; font-weight:bold;\">You</span> cannot be redeemed.  It is better to endure torture for a short while and<br />gain eternal life then [sic] to endure eternal torment in the Ring^H^H^H^H Lake<br />of Fire.  \"...If anyone worships the Beast and his image, and receives his <br />mark on his forehead or on his hand, he himself shall also drink the wine of<br />the wrath of God, which is poured out full strength into the cup of His <br />indignation.  An [sic] he shall be tormented with fire and brimstone in the <br />presence of the holy angels and in the presence of the Lamb.\" -Revelation <br />14:9-10 <br /><br />[and probably in the presence of season-ticket holders; special hats given to<br />the first 5,000 at the stadium --M] <br /><br />VII. SET A PLAN IN MOTION FOR SURVIVAL<br /><br />\tAlthough you may not be able to hide from the Antichrist's government<br />until the end of the Tribulation, all of the time you gain in hiding is <br />important for your spiritual growth and strengthening, since only those who are<br />extremely strong in Christ can suffer and die for His sake.<br />\tThe first thing to do is move out of the city and into a rural or<br />mountainous area, for the Antichrist's control will come last to the least<br />populated areas.  Take a good radio or TV with you so that you can stay <br />attuned to events and discern the time schedule of the Tribulation.<br />[\"As you can see on the weather map, heavy currents of Tribulation will sweep<br />into our area by daybreak.  Expect delays on I-95 outbound, and perhaps school<br />closings\" --M] <br />Store water and food, because you will not be able to purchase anything without<br />the mark.  Water in lakes and streams will be polluted by radioactive waste<br />from nuclear warfare and will eventually turn into blood.<br />[Get a good water filter. --M]<br />Bring different types of clothing for all seasons, as well as flashlights,<br />batteries, generators, and First Aid supplies.  In short, learn how to <br />survive and live off the land as the pioneers did.<br /><br />VIII. TRUST NO ONE<br />\t<br />\tThere will be secret agents everywhere, spying for the Antichrist's<br />government.  Be on the lookout.<br />[Perot supporters take note --M]<br /><br />IX. WATCH FOR THE ANTICHRIST<br /><br />\tIt is important to realize who the Antichrist is and what he is up to,<br />for he will deceive many into thinking that he is a great world leader who will<br />bring peace and prosperity to a world hungry for it.  We can infer from Daniel <br />11 certain characteristics of this man.  Popular during the first three and a<br />half years of the Tribulation, he will dominate the airwaves.  He will be <br />physically appealing, highly intelligent, with Christ-like charisma and <br />personality.  An international politician, military tactician and economic<br />expert, his word will be peace; he will make a treaty with the Jews, which<br />he will break after three and a half years.  He will have such supernatural <br />power that a mortal wound to his head will be healed.  Even the very elect will<br />be deceived.  If you do not pray and read the Bible, you too will be deceived.<br />[Dominate the airwaves?  Perhaps Howard Stern or Rush Limbaugh...-M]<br />\tThe antichrist will have a companion, the False Prohphet [sic], who<br />will make an image in the likeness of the Antichrist and cause it to speak.  <br />All who refuse to worhsip [sic] the image will be killed.  The final three and<br />a half years will be absolutely insane, with demonized spirits everywhere.<br /><br />X. DO NOT GIVE UP HOPE!<br /><br />\tThe seven years of Tribulation will end with the triumphant return of<br />Christ.  The Antichrist will be defeated.  Be steadfast and endure, and you <br />will be rewarded greatly in Heaven.  <br />\tStart reading the Bible and praying fervently now.  The salvation of <br />your sould depends upon it.  Determine that, come what may, you will not take<br />the mark or worship the Antichrist.  <span style=\"color: #d01c8b; font-weight:bold;\">You</span> still have a chance to be saved or<br />remain saved, but this time you will have to be \"faithful unto death.\"<br /><br />\tMay God find you ready in the hour of his glorious return!<br /><br />******************************************************************************<br />Mike Cluff\t\t\t\t*  \"Christianity is Stupid.<br />v22964qs@ubvms or mike%luick@ubvms\t*   Give up.\" -Negativland<br />UB Language Perception Laboratory\t*  <br />******************************************************************************<br /><br /><br />/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\ <br /><br />Bob Beauchaine bobbe@vice.ICO.TEK.COM <br /><br />They said that Queens could stay, they blew the Bronx away,<br />and sank Manhattan out at sea.<br /><br />^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br />", "exp": [["Re", -0.057703881388887407], ["California", -0.04708372558998903], ["You", -0.046809717943498697], ["atheists", -0.045935463206197361]]}, "id": 94, "true_class": 0}, {"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "From: mam@mouse.cmhnet.org (Mike McAngus)<br />Subject: Re: Americans and Evolution<br />Organization: The cat is on the mat <br />X-Newsreader: TIN [version 1.1 PL9]<br />Lines: 53<br /><br />On Tue, 20 Apr 1993 04:49:18 GMT bil@okcforum.osrhe.edu (Bill Conner) wrote:<br />&gt;Robert Singleton (bobs@thnext.mit.edu) wrote:<br /><br />&gt;: &gt; Sure it isn't mutually exclusive, but it lends weight to (i.e. increases<br />&gt;: &gt; notional running estimates of the posterior probability of) the <br />&gt;: &gt; atheist's pitch in the partition, and thus necessarily reduces the same <br />&gt;: &gt; quantity in the theist's pitch. This is because the `divine component' <br />&gt;: &gt; falls prey to Ockham's Razor, the phenomenon being satisfactorily <br />&gt;:                                 ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^<br />&gt;: &gt; explained without it, and there being no independent evidence of any <br />&gt;:   ^^^^^^^^^^^^^^^^^^^^<br />&gt;: &gt; such component. More detail in the next post.<br />&gt;: &gt; <br /><br />&gt;Occam's Razor is not a law of nature, it is way of analyzing an<br />&gt;argument, even so, it interesting how often it's cited here and to<br />&gt;what end. <br />&gt;It seems odd that religion is simultaneously condemned as being<br />&gt;primitive, simple-minded and unscientific, anti-intellectual and<br />&gt;childish, and yet again condemned as being too complex (Occam's<br />&gt;razor), the scientific explanation of things being much more<br />&gt;straightforeward and, apparently, simpler. <br /><br />Cute characterization Bill; however, there is no inconsistency between <br />the two statements.  Even if one believes that religion is \"primitive, <br />simple-minded and unscientific, anti-intellectual and childish\", one<br />can still hold the view that religion also adds an unnecessary level of<br />complexity to the explanation.  The ideas themselves don't have to be<br />complex before being excised by Occam's Razor, they only have to add <br />unnecessarily to the overall complexity of the description.<br /><br />&gt;                                           Which is it to be - which<br />&gt;is the \"non-essential\", and how do you know?<br /><br />I think the non-essential part of an explanatory system is one that<br />adds no predictive capability to the system.<br /><br />&gt;Considering that even scientists don't fully comprehend science due to<br />&gt;its complexity and diversity. Maybe William of Occam has performed a<br />&gt;lobotomy, kept the frontal lobe and thrown everything else away ...<br /><br />Huh?<br /><br />&gt;This is all very confusing, I'm sure one of you will straighten me out<br />&gt;tough.<br /> ^^^^^<br />Watch it, your Freudian Slip is showing<br /><br />--<br />Mike McAngus         | The Truth is still the Truth<br />mam@mouse.cmhnet.org | Even if you choose to ignore it.<br />                     |<br />(Some of the old .sig viruses are still the best)<br />", "exp": [["athos", 0.042758885992648946], ["writes", -0.027849510923076574], ["In", -0.027040413148281966], ["article", -0.021293439906505104]]}, "id": 87, "true_class": 0}, {"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "From: aaron@minster.york.ac.uk<br />Subject: <span style=\"color: #d01c8b; font-weight:bold;\">Re</span>: Gulf War / Selling Arms<br />Distribution: world<br />Organization: Department of Computer Science, University of York, England<br />Lines: 14<br /><br />Mark McCullough (mccullou@snake10.cs.wisc.edu) wrote:<br />: I heard about the arms sale to Saudi Arabia.  Now, how is it such a grave<br />: mistake to sell Saudi Arabia weapons?  Or are you claiming that we shouldn't<br />: sell any weapons to other countries?  Straightforward answer please.<br /><br />Saudi Arabia is an oppressive regime that has been recently interfering<br />in the politcs of newly renunified Yemen, including assasinations and <br />border incursions. It is entirely possible that they will soon invade.<br />Unluckily for Yemen it is not popular in the West as they managed to put<br />aside political differences during reunification and thus the West has<br />effectively lost one half (North?) as a client state.<br /><br />\t\tAaron Turner<br /> <br />", "exp": [["Posting", -0.18135596131646567], ["writes", -0.15450321679174836], ["In", -0.14229988392942222], ["Re", -0.13412561152691047]]}, "id": 25, "true_class": 0}, {"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "From: mussack@austin.ibm.com (Christopher Mussack)<br />Subject: What _do_ we feel?<br />Lines: 35<br /><br />I see a parallel between what I will stupidly call the \"homosexual\" <br />issue and the \"atheist\" issue. Please take no offense at these<br />comparisons.<br /><br />The homosexual \"feels\" things that I admit I do not \"feel\". <br />He learns that these feelings are classified as homosexual feelings<br />and learns of a model of sexuality that seems to apply to<br />his feelings, which he then can fit with his experiences.<br />That is, this model gives him a sense of understanding his<br />situation. Models that do not match up with what he knows he<br />feels will be discarded. However, one wonders if once accepting<br />the idea of his being gay and deciding what exactly that<br />means he will analyze all his feelings and experiences based on <br />the definition he has already accepted, which of course validates<br />his model.<br /><br />If that was hard to understand now listen to my parallel.<br /><br />The Christian \"feels\" things that an atheist claims he does not<br />feel. The Christian accepts the Christian theology as the true<br />description of what his feelings mean. Once accepting this<br />model he interprets his experiences with regards to this model<br />which of course validates his Christianity.<br /><br />As a reminder, I am a Christian, a Catholic, I don't hate <br />homosexuals or atheists, but am just trying to understand<br />them. I only compare them because they are both so foreign<br />to me. Am I as blind to the homosexual as the atheist seems<br />blind to me? Or am I as prejudiced against atheistic denial of<br />religious experience as the homosexual is prejudiced against <br />attempts by society to deny his sexuality?<br /><br />Or am I just out to lunch, again?<br /><br />Chris Mussack<br />", "exp": [["Christians", 0.041907713822849357], ["writes", -0.025056852652006814], ["Re", -0.021892067097151316], ["article", -0.019652141276591557]]}, "id": 567, "true_class": 1}, {"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "From: REXLEX@fnnews.fnal.gov<br />Subject: <span style=\"color: #d01c8b; font-weight:bold;\">Re</span>: FAQ essay on homosexuality<br />Organization: FNAL<br />Lines: 82<br /><br />In article &lt;May.14.02.10.20.1993.25156@athos.rutgers.edu&gt;<br />hudson@athena.cs.uga.edu (Paul Hudson Jr) writes:<br />&gt;I think we must be careful before we totally throw out Leviticus.  <br />&gt;If the Law is reflection of <span style=\"color: #4dac26; font-weight:bold;\">God</span>'s character and true holy nature, then<br />&gt;those who say that <span style=\"color: #4dac26; font-weight:bold;\">God</span> endorses homosexuality run into a problem<br /><br /><br />Though this will be addressed in the series of articles I'm posting now under<br />\"ARESNOKOITIA\", I can't wait.  This just really blew my socks off.  Read I Tim<br />1: 3-11.  Verses 3-8 speaks against those who have perverted the teachings of<br />the Mosaic Law.  In vv.9-10, we have, *IN ORDER*, the 5th thru the 9th<br />commandments and in the midst of this listing is \"homosexuals.\"  The decalogue,<br />above everything else, is seen as <span style=\"color: #4dac26; font-weight:bold;\">God</span>'s absolute.  If you don't believe in<br />absolutes, then you have nothing do do with Jehovah of the OT, which Paul<br />reveals <span style=\"color: #4dac26; font-weight:bold;\">to</span> be the Messiah of the NT. \"Lord Christ Jesus\" transliterates <span style=\"color: #4dac26; font-weight:bold;\">to</span> read<br />\"Jehovah's Anointed Savior.\"  <br />  In I Cor5, we see the same emphasis of moral separation from the pagan<br />gentiles as we do in Lev 18-20.  In I Cor 6:9-10, only one notation (drunkards)<br />is not found in Lev 18-20.  Paul was not naive in his use of the LXX.  He knew<br />full well how he was using the Law of <span style=\"color: #4dac26; font-weight:bold;\">God</span> that was given in the OT, for<br />application in the NT.  As I've said, the Law was fulfilled, not done away<br />with.<br /><br />&gt;&gt;of questions we are trying <span style=\"color: #4dac26; font-weight:bold;\">to</span> deal with.  He encountered homosexuality<br />&gt;&gt;only in contexts where most people would probably agree that it was<br />&gt;&gt;wrong.  He had never faced the experience of Christians who try <span style=\"color: #4dac26; font-weight:bold;\">to</span> act<br />&gt;&gt;\"straight\" and fail, and he had never faced Christians who are trying<br />&gt;&gt;<span style=\"color: #4dac26; font-weight:bold;\">to</span> define a Christian homosexuality, which fits with general Christian<br />&gt;&gt;ideals of fidelity and of seeing sexuality as a mirror of the<br />&gt;&gt;relationship between <span style=\"color: #4dac26; font-weight:bold;\">God</span> and man.  It is unfair <span style=\"color: #4dac26; font-weight:bold;\">to</span> take Paul's<br />&gt;&gt;judgement on homosexuality among idolaters and use it <span style=\"color: #4dac26; font-weight:bold;\">to</span> make<br />&gt;&gt;judgements on these questions.<br /><br />This understanding is thoroughly rebutted in DeYoungs article that is being<br />posted.  Please refer <span style=\"color: #4dac26; font-weight:bold;\">to</span> it.<br /><br />&gt;<br />&gt;One of the reasons that some of us do not accept that common argument<br />&gt;is because Paul probably did face this and other problems. <br /><br />We can do better than \"probably\" which is not an adequate defense against the<br />statement that Paul's culture didn't have the same understanding of<br />homosexuality as ours.  <br />Again read the article because it uses facts.<br /><br />&gt;&gt;I claim that the question of how <span style=\"color: #4dac26; font-weight:bold;\">to</span> counsel homosexual Christians is<br />&gt;&gt;not entirely a theological issue, but also a pastoral one.<br />&gt;<br />&gt;I don't see how you come <span style=\"color: #4dac26; font-weight:bold;\">to</span> that conclusion.<br /><br />I think I do, because I have worked in the homosexual community by means of<br />working with AIDs patients.  The pastoral is merely the practical application<br />of the theological truth however.  Those who are working thru the issue of<br />homosexuality need <span style=\"color: #4dac26; font-weight:bold;\">to</span> have our love and understanding just as with a friend who<br />is contiplating cheating on his wife or a friend who lives with his girlfriend,<br />yet you continue <span style=\"color: #4dac26; font-weight:bold;\">to</span> witness <span style=\"color: #4dac26; font-weight:bold;\">to</span> him.  But, once the choice is made, and there is<br />no remorse, then I feel that Paul's \"pastoral\" care, as presented in the<br />Corinthian Church, come <span style=\"color: #4dac26; font-weight:bold;\">to</span> bear significance.  THe one in active rebellion<br />should be placed outside of the church if a believer, and if a non-believer,<br />then one wipes his sandels and leaves it in Gods hand.  If there was a member<br />in your youth group who was constantly pawing at the little girls, you wouldn't<br />hesitate <span style=\"color: #4dac26; font-weight:bold;\">to</span> deal with the matter quickly and decisivly.  That, in part, betrays<br />the present \"political correctness\" of the issue.  Pederasty is not accepted at<br />the present, but some how we are <span style=\"color: #4dac26; font-weight:bold;\">to</span> accept homosexuality because the latter is<br />politically correct, while the former is not -at least not yet.  THis is how<br />the morals decay.  <br /><br />I guess this would follow the liberal application in the political realm of<br />economics.  The liberals want <span style=\"color: #4dac26; font-weight:bold;\">to</span> tax the rich in the federal, yet in their own<br />states, when they try <span style=\"color: #4dac26; font-weight:bold;\">to</span> get businesses <span style=\"color: #4dac26; font-weight:bold;\">to</span> settle there, they give tax<br />incentives <span style=\"color: #4dac26; font-weight:bold;\">to</span> these same richies.  It comes down <span style=\"color: #4dac26; font-weight:bold;\">to</span> a moral code of<br />relativeness, or <span style=\"color: #4dac26; font-weight:bold;\">to</span> use the cultural thing, politically correct -at the moment.<br />--Rex<br /><br />[You might want <span style=\"color: #4dac26; font-weight:bold;\">to</span> look over 1 Tim 1:10 again.  If this is really the<br />5th through 9th commandments, we seem <span style=\"color: #4dac26; font-weight:bold;\">to</span> be missing thieves, and<br />homosexuals would have <span style=\"color: #4dac26; font-weight:bold;\">to</span> be fit in under adultery.  This is of course<br />possible if \"arsenokoitia\" has a narrower meaning than homosexuality<br />in general, but I think that's not your thesis.  I have no objection<br />per se <span style=\"color: #4dac26; font-weight:bold;\">to</span> the idea that the author of 1 Tim might have quoted the 10<br />commandments, but 5 through 9, minus one and plus a few things, begins<br /><span style=\"color: #4dac26; font-weight:bold;\">to</span> look a bit marginal.  --clh]<br />", "exp": [["God", 0.0070673967677765386], ["to", 0.0065024402016439758], ["Re", -0.005659786653005882], ["so", -0.0016367747312606706]]}, "id": 311, "true_class": 1}, {"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "From: perry@dsinc.com (Jim Perry)<br />Subject: <span style=\"color: #d01c8b; font-weight:bold;\">Re</span>: Who has read Rushdie's _The Satanic Verses_?<br />Organization: Decision Support Inc.<br />Lines: 38<br />NNTP-Posting-Host: bozo.dsinc.com<br /><br />Another one rescued from the bit bucket...<br /><br />Over the years the furor over this book has been discussed on a.a. and<br />elsewhere on the net.  Generally, the discussion comes down to the<br />contention on the one hand that TSV contains such blood libel against<br />Islam as to merit, if not death, than at least banning and probably<br />some sort of punishment; and on the other that Rushdie, particularly<br />as a non-muslim in a Western country, had every right to write and<br />publish whatever he chose, regardless of whether some muslims find it<br />offensive, without fear of persecution or death.  <br /><br />I am naturally inclined to the latter position, but find myself in an<br />interesting position, because I think this is a fine book, only<br />incidentally concerned with Islam, and moreover I'm damned if I can<br />find anything malevolently offensive in it.<br /><br />Over the years, when I have made this point, various primarily muslim<br />posters have responded, saying that yes indeed they have read the book<br />and had called it such things as \"filth and lies\", \"I would rank<br />Rushdie's book with Hitler's Mein Kempf or worse\", and so on.<br />Unfortunately, these comments are usually generalities, and attempts<br />to follow up by requesting explanations for what specifically is so<br />offensive have met either with stony silence, more generalizations, or<br />inaccurate or out-of-context references to the book [which lead me to<br />believe that few of them have actually read it].  Corrections and<br />attempts to discuss the text in context have been ignored.<br /><br />Anyway, since I seem to be the only one following this particular line<br />of discussion, I wonder how many of the rest of the readership have<br />read this book?  What are your thoughts on it?  <br />-- <br />Jim Perry   perry@dsinc.com   Decision Support, Inc., Matthews NC<br />These are my opinions.  For a nominal fee, they can be yours.<br /><br /><br />-- <br />Jim Perry   perry@dsinc.com   Decision Support, Inc., Matthews NC<br />These are my opinions.  For a nominal fee, they can be yours.<br />", "exp": [["Christians", 0.0088706549406232481], ["clh", 0.0075611121021342109], ["In", -0.004619003909930388], ["Re", -0.0044890296179545246]]}, "id": 638, "true_class": 0}, {"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "From: armstrng@cs.dal.ca (Stan Armstrong)<br />Subject: Sleeping with one's aunt<br />Organization: Math, Stats &amp; CS, Dalhousie University, Halifax, NS, Canada<br />Lines: 37<br /><br />The last time we discussed homosexuality, I asked whether anyone could<br />identify any other act besides homosexual intercourse that the Bible<br />prohibited, but which might in some circumstances bring no apparent<br />harm to anyone. Put another way, the question is whether homosexual<br />intercourse is the only act that <span style=\"color: #4dac26; font-weight:bold;\">Christians</span> are supposed to <span style=\"color: #4dac26; font-weight:bold;\">believe</span><br />is immoral solely on the basis that God says it is, with no insight<br />being offered as to *why* it is immoral. No one could answer my<br />question in either form from the Bible. (I did get an interesting<br />response based on Roman Catholic theology).<br /><br />However, I think now that I can at least answer my first question.<br />Link Hudson pointed me to it in his recent comments about sleeping<br />with one's aunt. Incest is held to be immoral in every society,<br />that is, there are some degrees of relationship where marriage<br />(and thus, intercouse) is prohibited. The Bible is no exception.<br />The trouble is that it may be difficult to see *why* a particular<br />relationship qualifies as incestuous. Societies differ as to<br />how they define incest. Genetic reasons are sometimes offered, but<br />all the Biblical cases cannot be dealt with that way. Why can't<br />a man sleep with his step mother--assuming that his father is<br />dead and that he has \"married\" her? How does this case differ<br />from the *duty* to marry one's brother's childless wife.<br /><br />Are these two cases parallel? Does the Bible prohibit some incestuous<br />marriages and homosexual marriages for the same reason, perhaps<br />that God knows they are not good for us and yet we are incapable<br />of understanding why.<br /><br />P.S. Please don't bother writing me to tell me that I am a homophobe,<br />as some did last time. My mind is not made up on these questions.<br />You don't know whether I am homophobic or not. You don't<br />know me. To call me or anyone else a homophobe without knowing the<br />person may be as much an expression of bigotry as some homophobic<br />remarks.<br />-- <br />Stan Armstrong. Religious Studies Dept, Saint Mary's University, Halifax, N.S.<br />Armstrong@husky1.stmarys.ca | att!clyde!watmath!water!dalcs!armstrng<br />", "exp": [["Christians", 0.012819635448194103], ["In", -0.011380935284331871], ["clh", 0.0098308133396990058], ["believe", 0.0085370068675390265]]}, "id": 420, "true_class": 1}, {"c1": {"predict_proba": [0.23777645916023515, 0.76222354083976496], "data": "Subject: <span style=\"color: #d01c8b; font-weight:bold;\">Re</span>: Death Penalty / Gulf War (long)<br />From: sham@cs.arizona.edu (Shamim Zvonko Mohamed)<br /> &lt;1993Apr20.114137.883@batman.bmd.trw.com&gt; &lt;930421.113347.3M9.rusnews.w165w@mantis.co.uk&gt;<br />Organization: U of Arizona CS Dept, Tucson<br />Lines: 62<br /><br />This is the most unmitigated bilge I've seen in a while. Jim Brown obviously<br />has possession of the right-wing token.<br /><br />&gt; Diplomatic alternatives, including sanctions, were ineffective.<br /><br />\"<span style=\"color: #d01c8b; font-weight:bold;\">In</span> December, former national security adviser Zbigniew Brzezinski told a<br />Senate committee that sanctions were costing Iraq $100 million per day, and<br />that the multinational coalition could take all the time in the world.<br />Iraq, he suggested, was losing badly every day it defied the UN demands,<br />while the community of nations won every day -- with no taking of life or<br />loss of life.\"  -- FCNL Washington Newsletter.<br /><br />&gt; The world is full of evil, and circumstances are not perfect.  Many<br />&gt; innocents suffer due to the wrongful actions of others.  It it regretable,<br />&gt; but that's The-Way-It-Is.<br /><br />Wrongful actions of murderers like leaders of the US government, perhaps?<br />Regrettable, of course; The-Way-It-Is - certainly not.<br /><br />&gt; The media is not totally monolithic. ... There are even conservative<br />&gt; sources out there if you know where to look.  (Hurrah for Rush!)<br /><br />Good heavens! An escapee from Rush Limbot Land! \"Conservative\", my ass.<br /><br />&gt; And BTW, the reason I brought up the blanket-bombing in Germany was <br />&gt; because you were bemoaning the Iraqi civilian casualties as being <br />&gt; \"so deplorable\".  Yet blanket bombing was instituted because bombing <br />&gt; wasn't accurate enough to hit industrial/military targets in a <br />&gt; decisive way by any other method at that time.  But in the Gulf War, <br />&gt; precision bombing was the norm.<br /><br />BULLSHIT!!! <span style=\"color: #d01c8b; font-weight:bold;\">In</span> the Gulf Massacre, 7% of all ordnance used was \"smart.\" The<br />rest - that's 93% - was just regular, dumb ol' iron bombs and stuff. Have<br />you forgotten that the Pentagon definition of a successful Patriot launch<br />was when the missile cleared the launching tube with no damage? Or that a<br />successful interception of a Scud was defined as \"the Patriot and Scud<br />passed each other in the same area of the sky\"?<br /><br />And of the 7% that was the \"smart\" stuff, 35% hit. Again - try to follow me<br />here - that means 65% of this \"smart\" arsenal missed.<br /><br />&gt;                                                       The stories<br />&gt; of \"hundreds of thousands\" of Iraqi civilian dead is just plain bunk.<br /><br />Prove it. I have a source that says that to date, the civilian death count<br />(er, excuse me, I mean \"collateral damage\") is about 200,000.<br /><br />-s<br />--<br />   \"No one has attempted to calculate the costs of an execution in<br />Washington state, but studies elsewhere suggest it costs far more than<br />incarceration.<br />   \"California is spending more than $90 million annually on capital cases,<br />and until this year hadn't executed anyone since 1972.  Texas, the national<br />leader in the number of executions, spends an estimated $2.3 million per<br />execution.  That compares to an average cost of incarceration in Washington<br />state of $25,000 per maximum-security prisoner per year.\"<br />--<br />  Shamim Mohamed / {uunet,noao,cmcl2..}!arizona!shamim / shamim@cs.arizona.edu<br />  \"Take this cross and garlic; here's a Mezuzah if he's Jewish; a page of the<br />    Koran if he's a Muslim; and if he's a Zen Buddhist, you're on your own.\"<br />   Member of the League for Programming Freedom - write to lpf@uunet.uu.net<br />", "exp": [["In", -0.16340743187836593], ["article", -0.16313687852071487], ["Re", -0.16047410478140905], ["de", -0.095178435771513609]]}, "id": 209, "true_class": 0}], "class_names": ["Atheism", "Christianity"]}