data = {"instances": [{"c1": {"predict_proba": [0.99320029493562934, 0.006799705064370656], "data": "From: salem@pangea.Stanford.EDU (Bruce Salem)<br />Subject: <span style=\"color: #d01c8b; font-weight:bold;\">Re</span>: Science and theories<br />Organization: Stanford Univ. Earth Sciences<br />Lines: 42<br />NNTP-<span style=\"color: #d01c8b; font-weight:bold;\">Posting</span>-<span style=\"color: #d01c8b; font-weight:bold;\">Host</span>: pangea.stanford.edu<br /><br /><span style=\"color: #d01c8b; font-weight:bold;\">In</span> article &lt;C5u7Bq.J43@news.cso.uiuc.edu&gt; cobb@alexia.lis.uiuc.edu (Mike Cobb) <span style=\"color: #d01c8b; font-weight:bold;\">writes</span>:<br />&gt;As per various threads on science and creationism, I've started dabbling into a<br />&gt;book called Christianity and the Nature of Science by JP Moreland. <br /><br />\tAs I don't know this book, I will use your heresay.<br /><br />&gt; A question<br />&gt;that I had come from one of his comments.  He stated that God is not <br />&gt;necessarily a religious term, but could be used as other scientific terms that<br />&gt;give explanation for events or theories, without being a proven scientific <br />&gt;fact.<br /><br />\tIt depends on how he defines God. The way I understand the meaning<br />of that term preclues it being used in a useful way in science. Ideas drawn<br />from an understanding that God is supernatural precludes us from forming<br />scientific assertions that can be falsified, that is, where we can decide<br />that they are true or false within the terms of we use and useful observations<br />drawn from them.<br /><br />\tSome religionists have an interest in bluring the definitions within<br />science to make them more reconcilable, and especially subserviant in a basic<br />way, to religious dogma. This pursuit always fails.<br /><br />&gt;  I think I got his point -- I can quote the section if I'm being vague. <br />&gt;The examples he gave were quarks and continental plates.  Are there <br />&gt;explanations of science or parts of theories that are not measurable in and of<br />&gt;themselves, or can everything be quantified, measured, tested, etc.?  <br /><br />\tReconciliation of science with religion involves circumventing the<br />tendancy to claim that either pursuit can gain absolute or certian knowledge,<br />or that the domain of truth in each is fundementally limited in some way. It<br />gererally confurs the element of uncertainty and limitations to human knowledge<br />while allowing for the different concerns of these separate pursuits. Science<br />and religion ask different questions which have imperfect and provisional<br />answers, at best. Science is distinctly limited in where it can ask meaningful<br />questions. More questions can be posed than it can answer. At the basis of<br />sacred language is the place where words fail us and mere assertions disolve<br />in contradiction.<br /><br />Bruce Salem<br /><br /><br />", "exp": [["Host", -0.18363570121717238], ["Posting", -0.18135596131646567], ["writes", -0.15450321679174836], ["In", -0.14229988392942222], ["Re", -0.13412561152691047]]}, "id": 4, "true_class": 0}, {"c1": {"predict_proba": [0.071371158473027607, 0.92862884152697234], "data": "From: ptrei@bistromath.mitre.org (Peter Trei)<br />Subject: Re: Athiests and Hell<br />Organization: The MITRE Corporation<br />Lines: 106<br /><br />In <span style=\"color: #d01c8b; font-weight:bold;\">article</span> &lt;May.13.02.27.26.1993.1411@geneva.<span style=\"color: #4dac26; font-weight:bold;\">rutgers</span>.edu&gt; REXLEX@fnal.fnal.gov <span style=\"color: #d01c8b; font-weight:bold;\">writes</span>:<br />&gt;In <span style=\"color: #d01c8b; font-weight:bold;\">article</span> &lt;May.11.02.36.29.1993.28068@<span style=\"color: #4dac26; font-weight:bold;\">athos</span>.<span style=\"color: #4dac26; font-weight:bold;\">rutgers</span>.edu&gt;<br />&gt;ptrei@bistromath.mitre.org (Peter Trei) <span style=\"color: #d01c8b; font-weight:bold;\">writes</span>:<br />&gt;&gt;In <span style=\"color: #d01c8b; font-weight:bold;\">article</span> &lt;May.9.05.38.49.1993.27375@<span style=\"color: #4dac26; font-weight:bold;\">athos</span>.<span style=\"color: #4dac26; font-weight:bold;\">rutgers</span>.edu&gt; REXLEX@fnal.fnal.gov<br />&gt;<span style=\"color: #d01c8b; font-weight:bold;\">writes</span>:<br />&gt;&gt;[much deleted] <br />&gt;&gt;&gt;point today might be the Masons.  (Just a note, that they too worshipped <br />&gt;&gt;&gt;Osiris in Egypt...)<br />&gt;&gt;[much deleted] <br />&gt;&gt;<br />&gt;&gt;     It bugs me when I see this kind of nonsense.<br />&gt;&gt;<br />&gt;&gt;     First, there is no reasonable evidence linking Masonry to ancient<br />&gt;&gt;Egypt, or even that it existed prior to the late 14th century (and<br />&gt;&gt;there's nothing definitive before the 17th).<br />&gt;<br />[I'm going to cut \"Rex\"'s ramblings down a bit.]<br /><br />[...]<br />&gt;You must not be past your 20th level.  You should read Wilkinson's<br />&gt;Egyptians and how he shows this Egyptian religion paralleling his own British<br />&gt;Masonry.  There is a man here at this laboratory who is a 33 degree black<br />&gt;mason.  I've talked with him, [...]<br />&gt;There is the public side with motorcyle mania and<br />&gt;childrens hospitals and then there is the priviate side that only the highest<br />&gt;degree mason every learns of.<br /><br />   Rex, there are literally hundreds of thousands of 32nd degree<br />Masons in this country, and thousands of 33rds. If nasty stuff was<br />really going on, don't you think you'd have more than a couple of<br />disgruntled members \"exposing\" it? Heck, if what you say is true, then<br />Rev. Norman Vincent Peale is an Osiris worshiper.<br /> <br />[...<br />Long quote from someone named Hislop (source not given) deleted. I'm<br />attempting to extract from it the relevent points: <br /><br />  * Osiris is actually Nimrod, a Babylonian Deity. <br /><br />  * \"It is admitted that the secret system of Free Masonry was originally<br />    founded on the Mysteries of the Egyptian Isis, the goddess-mother, or<br />    wife of Osiris.\"<br /><br />  * The Babylonian Nimrod and Osiris are both connected with the building<br />    trade, ie, with Masonry.<br /><br />  * Nimrod, as the son of Cush, was a negro. [isn't this refering to a <br />    Biblical Nimrod, rather than the Babylonian god?]<br /><br />  *  ...there was a tradition in Egypt, recorded by Plutarch, that 'Osiris<br />     was black'.<br />...]<br /><br />     There is a long tradition in Masonry of claiming ancient lineage<br />for the order, on the flimsiest of grounds. This dates right back to<br />the Constitutions of 1738, which cite Adam as the first Mason. I've<br />seen other claims which place Masonry among the Romans, Greeks, and<br />Egyptians, and Atlanteans. I even have a book which claims to prove<br />that Stonehenge was originally a Masonic temple. <br /><br />    Claims prove nothing. Where's the beef, Rex?<br /><br />[...Claims ex-Mason showed him leopard skin he wore in lodge]<br />&gt; Any representation of Osiris usually show the wearing of some leopard.<br /><br />   I'd have to check this. The tomb paintings I remember don't show<br />this.<br /><br />&gt;  It is interesting that the Druids of Britian also show, or should I say<br />&gt; hide, this representation.  They, however, worshipped the \"spotted cow\".<br /><br />   Can you give ancient citations for this? The druids were suppressed<br />over 2000 years ago. What's your point?<br /><br />   This whole \"leopard skin\" business sounds bizarre.  I have not yet<br />gone through the Scottish Rite (which contains all of those \"higher<br />degrees\" anti-Masons get so excited about, and which was invented in<br />the 1750's), but I know enough people who have (and who are good<br /><span style=\"color: #4dac26; font-weight:bold;\">Christians</span>), that I reject your claim.<br /><br />&gt;I'll stand by my statements.  Masonry is of the \"mystery\" religions<br />&gt;that all find their source in Babylon, the great harlot. Sorry Peter,<br />&gt;I do not mean to be a \"cold slap to the face\" but there is to much<br /><br />Not so much a 'slap in the face' as 'a weary feeling of deja vu'. I'm<br />going through a very similar argument over on soc.culture.african.american.<br /><br />&gt;evidence to the contrary that Masonry doesn't find its origins in<br />&gt;Egypt.  Of the Masons I have personally talked to, all refered to<br />&gt;Egypt as their origin.  <br /><br />    Why don't you try reading some serious books on Masonic history, such<br />as Hamill's \"The Craft\"?<br /><br />&gt;Why are you now separating yourself from this which not many years ago,<br />&gt;was freely admitted?<br /><br />   Because we got honest. If you can come up with actual evidence that<br />Masonry existed prior to 1390, I'd be VERY impressed (actually,<br />anything earlier than 1630 would be pretty good.)<br /><br />&gt;-Rex<br />\t\t\t\t\t\tPeter Trei<br />\t\t\t\t\t\tptrei@mitre.org<br /><br />Disclaimer: I do not speak for my employer.<br />", "exp": [["rutgers", 0.14492535716215163], ["writes", -0.10095878616084945], ["article", -0.09287482233516603], ["athos", 0.085555428835332334], ["Christians", 0.074693914131161693]]}, "id": 174, "true_class": 1}, {"c1": {"predict_proba": [0.0045244369419033467, 0.99547556305809681], "data": "From: acooper@mac.cc.macalstr.edu (Turin Turambar, ME Department of Utter Misery)<br />Subject: From soc.religion.christian<br />Organization: Macalester College<br />Lines: 41<br /><br /><br /><br />I found this little gem, I don't know if anyone has any interest/comments...<br /><br /><br />--------------------------------------------------------------------------------<br /><br />Hi everyone,<br />           I'm a commited Christian that is battling with a problem.  I know<br />that romans talks about how we are saved by our faith not our deeds, yet<br />hebrews and james say that faith without deeds is useless, saying' <span style=\"color: #d01c8b; font-weight:bold;\">You</span> fools,<br />do you still think that just believing is enough?'<br /><br />Now if someone is fully believing but there life is totally lead by themselves<br />and not by <span style=\"color: #4dac26; font-weight:bold;\">God</span>, according <span style=\"color: #4dac26; font-weight:bold;\">to</span> Romans that person is still saved by there faith.<br />But then there is the bit which says that <span style=\"color: #4dac26; font-weight:bold;\">God</span> preferes someone who is cold <span style=\"color: #4dac26; font-weight:bold;\">to</span><br />him (i.e. doesn't know him - condemned) so a lukewarm Christian someone who<br />knows and believes <span style=\"color: #4dac26; font-weight:bold;\">in</span> <span style=\"color: #4dac26; font-weight:bold;\">God</span> but doesn't make any attempt <span style=\"color: #4dac26; font-weight:bold;\">to</span> live by the bible.<br /><br />Now I am of the opinion that you a saved through faith alone (not what you do)<br />as taught <span style=\"color: #4dac26; font-weight:bold;\">in</span> Romans, but how can I square up <span style=\"color: #4dac26; font-weight:bold;\">in</span> my mind the teachings of James<br /><span style=\"color: #4dac26; font-weight:bold;\">in</span> conjunction with the lukewarm Christian being 'spat-out'<br /><br />Can anyone help me, this really bothers me.-- <br /><br /><span style=\"color: #4dac26; font-weight:bold;\">in</span> <span style=\"color: #4dac26; font-weight:bold;\">Christ</span>,<br /><br />Will<br /><br /><br />--------------------------------------------------------------------------------<br /><br />--Adam<br /><br />================================================================================<br />| Adam John Cooper\t|\t\"Verily, often have I laughed at the weaklings |<br />| (612) 696-7521\t|\t   who thought themselves good simply because  |<br />| acooper@macalstr.edu\t|\t\t\tthey had no claws.\"\t       |<br />================================================================================<br />| \"Understand one another?  I fear I am beyond your comprehension.\" --Gandalf  |<br />================================================================================<br />", "exp": [["Christ", 0.015002664681930055], ["in", 0.007557487188295282], ["to", 0.0074362558495341844], ["God", 0.0074108524149482094], ["You", -0.0070731932784391226]]}, "id": 620, "true_class": 0}, {"c1": {"predict_proba": [0.99707448031476242, 0.0029255196852376957], "data": "From: Alan.Olsen@p17.f40.n105.z1.fidonet.org (Alan Olsen)<br />Subject: some <span style=\"color: #d01c8b; font-weight:bold;\">thoughts</span>.<br />Lines: 47<br /><br /><br />rh&gt; From: house@helios.usq.EDU.AU (ron house)<br />rh&gt; Newsgroups: <span style=\"color: #d01c8b; font-weight:bold;\">alt</span>.<span style=\"color: #d01c8b; font-weight:bold;\">atheism</span><br />rh&gt; Organization: University of Southern Queensland<br /><br />rh&gt; bissda@saturn.wwc.edu (DAN LAWRENCE BISSELL) <span style=\"color: #d01c8b; font-weight:bold;\">writes</span>:<br /><br />&gt;\tFirst I want to start right out and say that I'm a Christian.  It <br /><br />rh&gt; I _know_ I shouldn't get involved, but...   :-)<br /><br />rh&gt; [bit deleted]<br /><br />&gt;\tThe book says that Jesus was either a liar, or he was crazy ( a <br />&gt;modern day Koresh) or he was actually who he said he was.<br />[rest of rant deleted]<br /><br />This is a standard argument for fundies.  Can you spot the falicy? The<br />statement is arguing from the assumption that Jesus actually existed.  So far,<br />they have not been able to offer real proof of that existance.  Most of them<br />try it using the (very) flawed writings of Josh McDowell and others to prove<br />it, but those writers use VERY flawed sources.  (If they are real sources at<br />all, some are not.)  When will they ever learn to do real research, instead of<br />believing the drivel sold in the Christian bookstores.<br /><br />rh&gt; Righto, DAN, try this one with your Cornflakes...<br /><br />rh&gt; The book says that Muhammad was either a liar, or he was<br />rh&gt; crazy ( a  modern day Mad Mahdi) or he was actually who he<br />rh&gt; said he was. Some reasons why he wouldn't be a liar are as<br />rh&gt; follows.  Who would  die for a lie?  Wouldn't people be able<br />rh&gt; to tell if he was a liar?  People  gathered around him and<br />rh&gt; kept doing it, many gathered from hearing or seeing  how his<br />rh&gt; son-in-law made the sun stand still.  Call me a fool, but I<br />rh&gt; believe  he did make the sun stand still.  <br />rh&gt; Niether was he a lunatic.  Would more than an entire nation<br />rh&gt; be drawn  to someone who was crazy.  Very doubtful, in fact<br />rh&gt; rediculous.  For example  anyone who is drawn to the Mad<br />rh&gt; Mahdi is obviously a fool, logical people see  this right<br />rh&gt; away.<br />rh&gt; Therefore since he wasn't a liar or a lunatic, he must have<br />rh&gt; been the  real <span style=\"color: #d01c8b; font-weight:bold;\">thing</span>.  <br /><br />Nice rebutal!<br /><br />                   Alan<br /><br />", "exp": [["writes", -0.1790834887663583], ["atheism", -0.12732392127066663], ["thoughts", -0.11721238246342007], ["alt", -0.11043992358612623], ["thing", -0.10847886876176396]]}, "id": 714, "true_class": 0}, {"c1": {"predict_proba": [0.9895631217691977, 0.010436878230802285], "data": "From: mam@mouse.cmhnet.org (Mike McAngus)<br />Subject: <span style=\"color: #d01c8b; font-weight:bold;\">Re</span>: Death Penalty (was <span style=\"color: #d01c8b; font-weight:bold;\">Re</span>: Political Atheists?)<br />Organization: The cat is on the mat <br />X-<span style=\"color: #d01c8b; font-weight:bold;\">Newsreader</span>: TIN [version 1.1 PL9]<br />Lines: 37<br /><br />On Tue, 20 Apr <span style=\"color: #4dac26; font-weight:bold;\">1993</span> 04:32:59 GMT bil@okcforum.osrhe.edu (Bill Conner) wrote:<br />&gt;This is fascinating. Atheists argue for abortion, defend homosexuality<br />&gt;as a means of population control, insist that the only values are<br />&gt;biological and condemn war and capital punishment. According to<br />&gt;<span style=\"color: #d01c8b; font-weight:bold;\">Benedikt</span>, if something is contardictory, it cannot exist, which in<br />&gt;this case means <span style=\"color: #d01c8b; font-weight:bold;\">atheists</span> I suppose.<br /><br />What <span style=\"color: #d01c8b; font-weight:bold;\">atheists</span> are you talking about?  <br /><br />IMNSHO, Abortion is the womans choice.  Homosexual sex is the choice of <br />the people involved.  War is sometimes necessary.  <br /><br />This leaves capital punishment.  I oppose capital punishemnt because <br />mistakes can happen (yes this thread went around with no resolution<br />recently).<br /><br />As far as poplulation control, I think contraception and education are<br />the best courses of action.<br /><br />&gt;I would like to understand how an atheist can object to war (an<br />&gt;excellent means of controlling population growth), or to capital<br />&gt;punishment, I'm sorry but the logic escapes me.<br /><br />That's because you are again making the assumption that all Atheists <br />have some specific mindset.<br /><br />&gt;And why just capital punishment, what is being questioned here, the<br />&gt;propriety of killing or of punishment? What is the basis of the<br />&gt;ecomplaint?<br /><br />Mistakes can happen Bill, and I could be the victim of such a mistake.<br /><br />--<br />Mike McAngus         | The Truth is still the Truth<br />mam@mouse.cmhnet.org | Even if you choose to ignore it.<br />                     |<br />(Some of the old .sig viruses are still the best)<br />", "exp": [["Re", -0.22122658967124309], ["Newsreader", -0.17728518733136978], ["atheists", -0.15549673178890627], ["Benedikt", -0.13573481350022171], ["1993", 0.0091485738702207376]]}, "id": 342, "true_class": 0}, {"c1": {"predict_proba": [0.0047269762250487469, 0.99527302377495119], "data": "From: u9245669@athmail1.causeway.qub.ac.<span style=\"color: #d01c8b; font-weight:bold;\">uk</span><br />Subject: Christianity and repeated lives<br />Organization: UTexas Mail-<span style=\"color: #4dac26; font-weight:bold;\">to</span>-News Gateway<br />Lines: 38<br /><br />&gt;There is a paragraph in the <span style=\"color: #4dac26; font-weight:bold;\">New</span> Testament which in my opinion, clearly makes<br />&gt;a positive inference <span style=\"color: #4dac26; font-weight:bold;\">to</span> reincarnation. I don't remember which one it is off of<br />&gt;the top of my head, but it basically goes like this: <span style=\"color: #4dac26; font-weight:bold;\">Jesus</span> is talking with the<br />&gt;apostles and they ask him why the pharisees say that before the messiah can <br />&gt;come Elijah must first come. <span style=\"color: #4dac26; font-weight:bold;\">Jesus</span> replies that Elijah has come, but they did <br />&gt;not recognize him. It then says that the apostles perceived that he was refering <br />&gt;<span style=\"color: #4dac26; font-weight:bold;\">to</span> John the Baptist. This seems <span style=\"color: #4dac26; font-weight:bold;\">to</span> me <span style=\"color: #4dac26; font-weight:bold;\">to</span> clearly imply reincarnation.<br /><br />This was a popular belief in the Judaism of <span style=\"color: #4dac26; font-weight:bold;\">Jesus</span>` time, that Elijah<br />would return again (as he had been taken in <span style=\"color: #4dac26; font-weight:bold;\">to</span> heaven in a chariot and<br />did not actually die).  However <span style=\"color: #4dac26; font-weight:bold;\">Jesus</span> was referring <span style=\"color: #4dac26; font-weight:bold;\">to</span> John the<br />Baptist not in the sense that Elijah was reincarnated as John<br />(remember Elijah didn`t die) but that John was a similar prophet <span style=\"color: #4dac26; font-weight:bold;\">to</span><br />Elijah.  John was a fiery preacher, he wore sackcloth and wandered<br />rough through Israel preaching the coming kingdom.  The verses that<br />describe him (in Mark`s gospel) can be linked <span style=\"color: #4dac26; font-weight:bold;\">to</span> OT references about<br />Elijah.  Hence John was similar <span style=\"color: #4dac26; font-weight:bold;\">to</span> Elijah and <span style=\"color: #4dac26; font-weight:bold;\">Jesus</span> was drawing the<br />parallels between the two just as he drew parallels with the Suffering<br />Servant in Isaiah (and other messianic figures) and himself.<br /><br />A brief reply but I don`t have time <span style=\"color: #4dac26; font-weight:bold;\">to</span> look <span style=\"color: #d01c8b; font-weight:bold;\">up</span> all the relevant stuff.<br /><br />Suffice <span style=\"color: #4dac26; font-weight:bold;\">to</span> say there is a very strong explanation.<br /><br /><br /><br />Rick.<br /><br />________________________________________________________________<br /><br />Richard Johnston                             Queen`s University<br />73 Malone Road                               Belfast<br />Belfast                                 <br />Northern Ireland                          <br />BT9 6SB                                   <br /><br />u9245669@athmail1.causeway.qub.ac.<span style=\"color: #d01c8b; font-weight:bold;\">uk</span><br />________________________________________________________________<br />", "exp": [["Jesus", 0.0082498423611390651], ["to", 0.0077961159192850953], ["New", 0.0073245008945786111], ["uk", -0.0047740151834392112], ["up", -0.0033532525264582738]]}, "id": 647, "true_class": 1}, {"c1": {"predict_proba": [0.97257894412673129, 0.027421055873268749], "data": "From: mangoe@cs.<span style=\"color: #d01c8b; font-weight:bold;\">umd</span>.edu (<span style=\"color: #d01c8b; font-weight:bold;\">Charley</span> <span style=\"color: #d01c8b; font-weight:bold;\">Wingate</span>)<br />Subject: Hyslop and _The_Two_Babylons_<br />Lines: 9<br /><br />Seeing as how _The_Two_Babylons_ has been brought up again, it is time for<br />me to respond , once again, and say that this book is junk.  It is nothing<br />more that an anti-Catholic tract of the sort published ever since the there<br />were protestants.  Its scholarship is phony and its assertions spurious.<br />-- <br />C. <span style=\"color: #d01c8b; font-weight:bold;\">Wingate</span>        + \"The peace of God, it is no peace,<br />                  +    but strife closed in the sod.<br />mangoe@cs.<span style=\"color: #d01c8b; font-weight:bold;\">umd</span>.edu +  <span style=\"color: #d01c8b; font-weight:bold;\">Yet</span>, brothers, pray for but one <span style=\"color: #d01c8b; font-weight:bold;\">thing</span>:<br />tove!mangoe       +    the marv'lous peace of God.\"<br />", "exp": [["umd", -0.19547275722547949], ["Charley", -0.16943761069320479], ["thing", -0.16574683366718432], ["Wingate", -0.16507805117312269], ["Yet", -0.16330675127676963]]}, "id": 54, "true_class": 1}, {"c1": {"predict_proba": [1.333468534823938e-06, 0.99999866653146519], "data": "From: atterlep@vela.acs.oakland.edu (Cardinal Ximenez)<br />Subject: Dialogue with conservatives wanted<br />Organization: National Association for the Disorganized<br />Lines: 14<br /><br /><br />  Are there any members of conservative, <span style=\"color: #d01c8b; font-weight:bold;\">religious</span>, politically active groups<br />(such as the Christian Coalition) out there?  I come from a very liberal <br />background, and I'd like <span style=\"color: #4dac26; font-weight:bold;\">to</span> talk <span style=\"color: #4dac26; font-weight:bold;\">to</span> some conservative people out there in a <br />public forum (such as this one.)  I frankly can't understand the rationale or<br />Christian basis for much of the conservative position, and I'd like <span style=\"color: #4dac26; font-weight:bold;\">to</span> <span style=\"color: #d01c8b; font-weight:bold;\">try</span> and<br />learn <span style=\"color: #d01c8b; font-weight:bold;\">more</span> about this movement--after all, we're part of the same <span style=\"color: #4dac26; font-weight:bold;\">church</span>.  Is<br />anyone interested in explaining a bit about the conservative viewpoint?<br />  Thanks.<br /><br />Alan Terlep\t\t\t\t\"If your children knew just how<br />Oakland University, Rochester, MI\t   lame you were, they'd murder<br />atterlep@vela.acs.oakland.edu\t\t      you in your sleep.\"<br />Rushing in where angels fear <span style=\"color: #4dac26; font-weight:bold;\">to</span> tread.\t\t\t      --Frank Zappa<br />", "exp": [["church", 0.0035831166861109128], ["to", 0.003398508769899041], ["more", -0.00034331177734372184], ["try", -0.00021166174432664928], ["religious", -0.00016509160238231652]]}, "id": 16, "true_class": 1}, {"c1": {"predict_proba": [7.0394490204692921e-06, 0.99999296055097964], "data": "From: ossm1jl@rex.re.uokhsc.edu (Justin Lee)<br />Subject: <span style=\"color: #d01c8b; font-weight:bold;\">Re</span>: Satan kicked out of heaven: Biblical?<br />Organization: Health Sciences Center, University of Oklahoma<br />Lines: 13<br /><br />[Someone asked about Biblical support for the image of Satan as<br />a fallen angel.  Rev 12:7-9 and Enoch have been cited.  --<span style=\"color: #4dac26; font-weight:bold;\">clh</span>]<br /><br />There is <span style=\"color: #4dac26; font-weight:bold;\">also</span> a verse in Luke(?) that says <span style=\"color: #4dac26; font-weight:bold;\">He</span>[Jesus] saw Satan fall<br />from Heaven.  It's something like that.  I don't have my Bible in<br />front of me or I would quote it directly, but it's a pretty obvious<br />reference to Satan's expulsion.<br /><br />Justin<br /><br />[I <span style=\"color: #4dac26; font-weight:bold;\">believe</span> the reference is to Luke 10:18.  The context of the passage<br />makes it possible that Jesus is referring to Satan being defeated by<br />Jesus' mission, rather than a previous fall from heaven.  --<span style=\"color: #4dac26; font-weight:bold;\">clh</span>]<br />", "exp": [["clh", 0.0076480978816281953], ["Re", -0.0063090271163820022], ["also", 0.0057558374196711179], ["He", 0.0053930986088865981], ["believe", 0.0049594692308266609]]}, "id": 662, "true_class": 1}, {"c1": {"predict_proba": [0.0083579895268027209, 0.99164201047319733], "data": "From: PETCH@gvg47.gvg.tek.com (Chuck)<br />Subject: Daily Verse<br />Lines: 6<br /><br /><br />   This is what the LORD Almighty says: \"<span style=\"color: #d01c8b; font-weight:bold;\">You</span> <span style=\"color: #4dac26; font-weight:bold;\">who</span> now hear these words spoken <span style=\"color: #4dac26; font-weight:bold;\">by</span><br />the prophets <span style=\"color: #4dac26; font-weight:bold;\">who</span> were there when the foundation was laid for the house of the<br />LORD Almighty, let your hands be strong <span style=\"color: #d01c8b; font-weight:bold;\">so</span> that the temple <span style=\"color: #4dac26; font-weight:bold;\">may</span> be built.<br /><br />Zechariah 8:9<br />", "exp": [["by", 0.0076686751149609295], ["may", 0.0074713308204667726], ["who", 0.007384371665777041], ["You", -0.0054891720511429255], ["so", -0.0054551823460128905]]}, "id": 106, "true_class": 1}], "class_names": ["Atheism", "Christianity"]}